bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/src/bl702l_glb.c
    /* GLB->dll.BF.dll_prechg_sel = 1;   */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_DLL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_PRECHG_SEL, 1);
    BL_WR_REG(GLB_BASE, GLB_DLL, tmpVal);

    /* GLB->dll.BF.ppu_dll = 1;   */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_DLL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_PPU_DLL, 1);
    BL_WR_REG(GLB_BASE, GLB_DLL, tmpVal);

    BL702L_Delay_US(2);

    /* GLB->dll.BF.pu_dll = 1; */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_DLL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_PU_DLL, 1);
    BL_WR_REG(GLB_BASE, GLB_DLL, tmpVal);

    BL702L_Delay_US(2);

    /* GLB->dll.BF.dll_reset = 0; */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_DLL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_RESET, 0);
    BL_WR_REG(GLB_BASE, GLB_DLL, tmpVal);

    /* delay for settling */
    BL702L_Delay_US(5);

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  enable all DLL output clock
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_CLOCK_SECTION GLB_Enable_DLL_All_Clks(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_DLL2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV1_RF, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV63, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV21, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV5, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV3, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV2, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV1, 1);
    BL_WR_REG(GLB_BASE, GLB_DLL2, tmpVal);

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  enable one of DLL output clock
 *
 * @param  dllClk: None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_CLOCK_SECTION GLB_Enable_DLL_Clk(GLB_DLL_CLK_Type dllClk)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_GLB_DLL_CLK_TYPE(dllClk));

    tmpVal = BL_RD_REG(GLB_BASE, GLB_DLL2);
    switch (dllClk) {
        case GLB_DLL_CLK_RF:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV1_RF, 1);
            break;
        case GLB_DLL_CLK_2P032M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV63, 1);
            break;
        case GLB_DLL_CLK_6P095M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV21, 1);
            break;
        case GLB_DLL_CLK_25P6M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV5, 1);
            break;
        case GLB_DLL_CLK_42P67M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV3, 1);
            break;
        case GLB_DLL_CLK_64M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV2, 1);
            break;
        case GLB_DLL_CLK_128M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV1, 1);
            break;
        default:
            break;
    }
    BL_WR_REG(GLB_BASE, GLB_DLL2, tmpVal);

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  disable all DLL output clock
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_CLOCK_SECTION GLB_Disable_DLL_All_Clks(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_DLL2);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV1_RF, 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV63, 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV21, 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV5, 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV3, 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV2, 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV1, 0);
    BL_WR_REG(GLB_BASE, GLB_DLL2, tmpVal);

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  disable one of DLL output clock
 *
 * @param  dllClk: None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_CLOCK_SECTION GLB_Disable_DLL_Clk(GLB_DLL_CLK_Type dllClk)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_GLB_DLL_CLK_TYPE(dllClk));

    tmpVal = BL_RD_REG(GLB_BASE, GLB_DLL2);
    switch (dllClk) {
        case GLB_DLL_CLK_RF:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV1_RF, 0);
            break;
        case GLB_DLL_CLK_2P032M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV63, 0);
            break;
        case GLB_DLL_CLK_6P095M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV21, 0);
            break;
        case GLB_DLL_CLK_25P6M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV5, 0);
            break;
        case GLB_DLL_CLK_42P67M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV3, 0);
            break;
        case GLB_DLL_CLK_64M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV2, 0);
            break;
        case GLB_DLL_CLK_128M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_EN_DIV1, 0);
            break;

        default:
            break;
    }
    BL_WR_REG(GLB_BASE, GLB_DLL2, tmpVal);

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  set flash id value
 *
 * @param  idValue: flash id value
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION GLB_Set_Flash_Id_Value(uint32_t idValue)
{
    BL_WR_REG(GLB_BASE, GLB_RSV0, (idValue | BFLB_FLASH_ID_VALID_FLAG));

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  get flash id value
 *
 * @param  None
 *
 * @return flash id
 *
*******************************************************************************/
uint32_t ATTR_TCM_SECTION GLB_Get_Flash_Id_Value(void)
{
    uint32_t tmpVal = 0;

