bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/src/bl702l_glb.c
    tmpVal = BL_RD_REG(GLB_BASE, GLB_RSV0);
    if ((tmpVal & BFLB_FLASH_ID_VALID_FLAG) != 0) {
        return (tmpVal & BFLB_FLASH_ID_VALID_MASK);
    }

    return 0x00000000;
}

/****************************************************************************/ /**
 * @brief  Trim RC32M
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION GLB_Trim_RC32M(void)
{
    bflb_ef_ctrl_com_trim_t trim;
    int32_t tmpVal = 0;

    bflb_ef_ctrl_read_common_trim(NULL, "rc32m", &trim, 1);
    if (trim.en) {
        if (trim.parity == bflb_ef_ctrl_get_trim_parity(trim.value, trim.len)) {
            tmpVal = BL_RD_REG(GLB_BASE, GLB_RC32M_CTRL0);
            tmpVal = BL_SET_REG_BIT(tmpVal, GLB_RC32M_EXT_CODE_EN);
            BL_WR_REG(GLB_BASE, GLB_RC32M_CTRL0, tmpVal);
            arch_delay_us(2);
            tmpVal = BL_RD_REG(GLB_BASE, GLB_RC32M_CTRL1);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_RC32M_CODE_FR_EXT2, trim.value);
            BL_WR_REG(GLB_BASE, GLB_RC32M_CTRL1, tmpVal);
            tmpVal = BL_RD_REG(GLB_BASE, GLB_RC32M_CTRL1);
            tmpVal = BL_SET_REG_BIT(tmpVal, GLB_RC32M_EXT_CODE_SEL);
            BL_WR_REG(GLB_BASE, GLB_RC32M_CTRL1, tmpVal);
            /* hw_5T + sw_5T  */
            arch_delay_us(1);
            return SUCCESS;
        }
    }

    return ERROR;
}

/****************************************************************************/ /**
 * @brief  Set xtal_cnt_32k_process(0x4000E04C[29])
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_Set_Xtal_Cnt32k_Process(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_XTAL_DEG_32K);
    tmpVal = BL_SET_REG_BIT(tmpVal, GLB_XTAL_CNT_32K_SW_TRIG_PS);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_CLR_XTAL_CNT_32K_DONE);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_RC32K_DEG_START_PS);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_RC32K_DEG_END_PS);
    BL_WR_REG(GLB_BASE, GLB_XTAL_DEG_32K, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Clear xtal_cnt_32k_done(0x4000E04C[30])
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_Clear_Xtal_Cnt32k_Done(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_XTAL_DEG_32K);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_XTAL_CNT_32K_SW_TRIG_PS);
    tmpVal = BL_SET_REG_BIT(tmpVal, GLB_CLR_XTAL_CNT_32K_DONE);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_RC32K_DEG_START_PS);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_RC32K_DEG_END_PS);
    BL_WR_REG(GLB_BASE, GLB_XTAL_DEG_32K, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  GLB start RC32K deg
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_RC32K_Deg_Start(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_XTAL_DEG_32K);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_XTAL_CNT_32K_SW_TRIG_PS);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_CLR_XTAL_CNT_32K_DONE);
    tmpVal = BL_SET_REG_BIT(tmpVal, GLB_RC32K_DEG_START_PS);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_RC32K_DEG_END_PS);
    BL_WR_REG(GLB_BASE, GLB_XTAL_DEG_32K, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  GLB end RC32K deg
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_RC32K_Deg_End(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_XTAL_DEG_32K);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_XTAL_CNT_32K_SW_TRIG_PS);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_CLR_XTAL_CNT_32K_DONE);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_RC32K_DEG_START_PS);
    tmpVal = BL_SET_REG_BIT(tmpVal, GLB_RC32K_DEG_END_PS);
    BL_WR_REG(GLB_BASE, GLB_XTAL_DEG_32K, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  GLB enable or disable RC32K deg
 *
 * @param  enable: ENABLE or DISABLE
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_RC32K_Deg_Enable(uint8_t enable)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_XTAL_DEG_32K);
    if (enable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, GLB_REG_RC32K_DEG_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_REG_RC32K_DEG_EN);
    }
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_XTAL_CNT_32K_SW_TRIG_PS);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_CLR_XTAL_CNT_32K_DONE);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_RC32K_DEG_START_PS);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_RC32K_DEG_END_PS);
    BL_WR_REG(GLB_BASE, GLB_XTAL_DEG_32K, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  GLB set XTAL deg cnt limit value
 *
 * @param  cnt: 0~255
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_Xtal_Deg_Cnt_Limit_Set(uint8_t cnt)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_XTAL_DEG_32K);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_XTAL_DEG_CNT_LIMIT, cnt);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_XTAL_CNT_32K_SW_TRIG_PS);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_CLR_XTAL_CNT_32K_DONE);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_RC32K_DEG_START_PS);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_RC32K_DEG_END_PS);
    BL_WR_REG(GLB_BASE, GLB_XTAL_DEG_32K, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Enable ir led driver
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_IR_LED_Driver_Enable(void)
{
    uint32_t tmpVal = 0;

